# Index Aligment

In [1]:
import pandas as pd
import numpy as np

In [2]:
A = pd.DataFrame(np.random.randint(0, 5, (2,2)), columns=['A', 'B'])
A

   A  B
0  0  2
1  2  1

In [3]:
B = pd.DataFrame(np.random.randint(0, 5, (3,3)), columns=['B', 'A', 'C'])
B

   B  A  C
0  1  0  3
1  4  2  4
2  1  1  0

In [4]:
A + B

     A    B   C
0  0.0  3.0 NaN
1  4.0  5.0 NaN
2  NaN  NaN NaN

### Operations between DataFrames and Series

In [27]:
rng = np.random

In [28]:
A = rng.randint(10, size=(3,4))
A

array([[9, 4, 5, 8],
       [3, 8, 9, 5],
       [7, 9, 8, 0]])

In [29]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-6,  4,  4, -3],
       [-2,  5,  3, -8]])

In [30]:
df = pd.DataFrame(A, columns=list('QRST'))
df

   Q  R  S  T
0  9  4  5  8
1  3  8  9  5
2  7  9  8  0

In [31]:
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -6  4  4 -3
2 -2  5  3 -8

In [32]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  5  0  1  4
1 -5  0  1 -3
2 -2  0 -1 -9

In [33]:
A = pd.DataFrame(np.random.randint(0, 5, (4,3)), columns=['B', 'A', 'C'])
A

   B  A  C
0  1  2  2
1  2  4  3
2  3  1  4
3  4  4  2

In [34]:
first_row = A.iloc[0]
first_row

B    1
A    2
C    2
Name: 0, dtype: int32

In [35]:
second_row = A.iloc[1]
second_row

B    2
A    4
C    3
Name: 1, dtype: int32

In [36]:
first_col = A.iloc[:,0]
first_col

0    1
1    2
2    3
3    4
Name: B, dtype: int32

In [37]:
second_col = A.iloc[:,1]
second_col

0    2
1    4
2    1
3    4
Name: A, dtype: int32

In [38]:
A = A - first_row
A

   B  A  C
0  0  0  0
1  1  2  1
2  2 -1  2
3  3  2  0

In [39]:
max_value = A.max().max()
max_value

3

In [40]:
A = A.divide(max_value)
A

          B         A         C
0  0.000000  0.000000  0.000000
1  0.333333  0.666667  0.333333
2  0.666667 -0.333333  0.666667
3  1.000000  0.666667  0.000000

In [41]:
def normalize(df):
    first_row = df.iloc[0]
    df = df - first_row
    max_value = df.max().max()
    df = df.divide(max_value)
    return df

In [44]:
novo1 = pd.DataFrame(np.random.randint(0, 5, (8,2)), columns=['B', 'A'])

In [45]:
normalize(novo1)

          B         A
0  0.000000  0.000000
1  0.666667 -1.000000
2  0.666667 -0.333333
3  0.333333  0.000000
4  1.000000 -0.333333
5  0.333333 -0.666667
6  0.666667 -0.666667
7  0.000000 -0.333333

### Missing Values

In [46]:
df = pd.DataFrame([[1, np.nan, 2],
                    [2, 3, 4],
                    [None, 4, 5]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  4
2  NaN  4.0  5

In [48]:
df.dropna() # elimina as linhas com NaN

     0    1  2
1  2.0  3.0  4

In [49]:
df.dropna(axis='columns')

   2
0  2
1  4
2  5

In [50]:
df.isna()

       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False

In [51]:
df.isna().sum().sum()

2

In [52]:
df[3] = np.nan

In [53]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  4 NaN
2  NaN  4.0  5 NaN

In [54]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  4 NaN

In [55]:
df.dropna(axis='rows', thresh=2)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  4 NaN
2  NaN  4.0  5 NaN

In [56]:
df.fillna(0)

     0    1  2    3
0  1.0  0.0  2  0.0
1  2.0  3.0  4  0.0
2  0.0  4.0  5  0.0

In [57]:
df.fillna(df.mean().mean())

          0         1  2         3
0  1.000000  2.888889  2  2.888889
1  2.000000  3.000000  4  2.888889
2  2.888889  4.000000  5  2.888889

In [58]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  4 NaN
2  NaN  4.0  5 NaN

In [59]:
df.fillna(method='ffill') # forwardfill

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  4 NaN
2  2.0  4.0  5 NaN

In [60]:
df.fillna(method='bfill') #backwardfill

     0    1  2   3
0  1.0  3.0  2 NaN
1  2.0  3.0  4 NaN
2  NaN  4.0  5 NaN

In [61]:
df.fillna(method='ffill', axis='columns').fillna(method='ffill') #forwardfill

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  4.0  4.0
2  2.0  4.0  5.0  5.0

In [62]:
df = pd.DataFrame({'A': [1, 2, np.nan, 4, 5],
                   'B': [6, np.nan, 8, 9, 10],
                   'C': [11, 12, 13, np.nan, 15],
                   'D': [16, 17, 18, 19, np.nan]})
df

     A     B     C     D
0  1.0   6.0  11.0  16.0
1  2.0   NaN  12.0  17.0
2  NaN   8.0  13.0  18.0
3  4.0   9.0   NaN  19.0
4  5.0  10.0  15.0   NaN

In [63]:
df.isna().sum()

A    1
B    1
C    1
D    1
dtype: int64

In [65]:
df.fillna(0, inplace=False)

     A     B     C     D
0  1.0   6.0  11.0  16.0
1  2.0   0.0  12.0  17.0
2  0.0   8.0  13.0  18.0
3  4.0   9.0   0.0  19.0
4  5.0  10.0  15.0   0.0

In [66]:
df

     A     B     C     D
0  1.0   6.0  11.0  16.0
1  2.0   NaN  12.0  17.0
2  NaN   8.0  13.0  18.0
3  4.0   9.0   NaN  19.0
4  5.0  10.0  15.0   NaN

In [67]:
df.mean()

A     3.00
B     8.25
C    12.75
D    17.50
dtype: float64

In [68]:
df.fillna(df.mean(), inplace=True)

In [69]:
df

     A      B      C     D
0  1.0   6.00  11.00  16.0
1  2.0   8.25  12.00  17.0
2  3.0   8.00  13.00  18.0
3  4.0   9.00  12.75  19.0
4  5.0  10.00  15.00  17.5